# Removing columns from a pandas DataFrame

In [1]:
import pandas as pd
df = pd.read_csv("Datasets\weather_data.csv")
df.head()

        day  temperature  wind speed  event                  city state
0  1/1/2019           32           6   Rain                Ithaca    NY
1  1/4/2019       -99999           9  Sunny           Willingboro    NJ
2  1/5/2019           28      -99999   Snow               Holyoke    CO
3  1/6/2019       -99999           7      0               Abilene    KS
4  1/7/2019           32      -99999   Rain  New York Worlds Fair    NY

In [2]:
# Removing column
# axis=0 row axis
# axis=1 column axis
# inplace=True to effect change
df.drop('wind speed', axis=1, inplace=True)

In [3]:
df.head()

        day  temperature  event                  city state
0  1/1/2019           32   Rain                Ithaca    NY
1  1/4/2019       -99999  Sunny           Willingboro    NJ
2  1/5/2019           28   Snow               Holyoke    CO
3  1/6/2019       -99999      0               Abilene    KS
4  1/7/2019           32   Rain  New York Worlds Fair    NY

In [4]:
# Removing multiple columns
list_drop = ['event', 'city' , 'state']
df.drop(list_drop, axis=1, inplace=True)

In [5]:
df.head()

        day  temperature
0  1/1/2019           32
1  1/4/2019       -99999
2  1/5/2019           28
3  1/6/2019       -99999
4  1/7/2019           32

In [6]:
# Removing rows 0 and 1
# axis=0 is the default, so technically, you can leave this out
rows = [0, 1]
df.drop(rows, axis=0, inplace=True)

In [7]:
df.head()

        day  temperature
2  1/5/2019           28
3  1/6/2019       -99999
4  1/7/2019           32
5  1/8/2019       -99999
6  1/9/2019       -99999